&НаКлиенте
Перем КонтекстЯдра;

// { Plugin interface
&НаКлиенте
Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	КонтекстЯдра = КонтекстЯдраПараметр;
КонецПроцедуры

&НаКлиенте
Функция ОписаниеПлагина(ВозможныеТипыПлагинов) Экспорт
	Возврат ОписаниеПлагинаНаСервере(ВозможныеТипыПлагинов);
КонецФункции

&НаСервере
Функция ОписаниеПлагинаНаСервере(ВозможныеТипыПлагинов)
	Возврат ЭтотОбъектНаСервере().ОписаниеПлагина(ВозможныеТипыПлагинов);
КонецФункции
// } Plugin interface

// { ПрограммныйИнтерфейс
Процедура ЗагрузитьИзФайла(ИмяФайла) Экспорт
	ЗагрузитьИзФайлаНаСервере(ИмяФайла);
КонецПроцедуры

Процедура ЗагрузитьИзМакета(ТекстДок) Экспорт
	ЗагрузитьИзМакетаНаСервере(ТекстДок);
КонецПроцедуры
// } ПрограммныйИнтерфейс

// { СлужебныеПроцедурыИФункции
Процедура ЗагрузитьИзФайлаНаСервере(ИмяФайла) Экспорт
	ЭтотОбъектНаСервере().ЗагрузитьИзФайла(ИмяФайла);
КонецПроцедуры

Процедура ЗагрузитьИзМакетаНаСервере(ТекстДок)
	ЭтотОбъектНаСервере().ЗагрузитьИзМакета(ТекстДок);
КонецПроцедуры
// } СлужебныеПроцедурыИФункции

// { Helpers
&НаСервере
Функция ЭтотОбъектНаСервере()
	Возврат РеквизитФормыВЗначение("Объект");
КонецФункции
// } Helpers
