///////////////////////////////////////////////////
//Служебная часть
///////////////////////////////////////////////////

&НаКлиенте
// контекст фреймворка Vanessa-ADD
Перем Ванесса;

&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;

&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-ADD.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;

	ВсеТесты = Новый Массив;
	
	// описание шагов
	// пример вызова Ванесса.ДобавитьШагВМассивТестов(ВсеТесты, Снипет, ИмяПроцедуры, ПредставлениеТеста, ОписаниеШага, ТипШагаДляОписания, ТипШагаВДереве);
	
	ПредставлениеТеста = "Загружает данные из макета XML, полученного через пакет Конвертация данных 2."
		+ " Как и в соседних шага, макет может располагаться в каталоге проекта и можно указать путь относительно каталога проекта. Можно не указывать расширение xml."
		+ " Пример - 'Макеты\ИмяФайлаМакета'";
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты, "ЯЗагружаюМакетКомпоновкиДанных(Парам01,Парам02)", "ЯЗагружаюМакетКомпоновкиДанных", 
		"И я загружаю макет Компоновки данных 2 ""fixtures\ИмяФайлаМакета""", ПредставлениеТеста, "Данные.Макеты");
	
	Возврат ВсеТесты;
КонецФункции

///////////////////////////////////////////////////
//Работа со сценариями
///////////////////////////////////////////////////

//&НаСервере
//// Служебная функция.
//Функция ПолучитьМакетСервер(ИмяМакета)
//	ОбъектСервер = РеквизитФормыВЗначение("Объект");
//	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
//КонецФункции

//&НаКлиенте
//// Служебная функция для подключения библиотеки создания fixtures.
//Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
//	Возврат ПолучитьМакетСервер(ИмяМакета);
//КонецФункции

///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////

&НаКлиенте
//И     я загружаю макет Компоновки данных 2 "Макеты\ИмяФайлаМакета"
//@ЯЗагружаюМакетКомпоновкиДанных2(Парам01)
Процедура ЯЗагружаюМакетКомпоновкиДанных(ВерсияКонвертации, Знач ИмяМакета) Экспорт
	
	ЕдинственнаяРеализованнаяВерсияКД = 2;
	Если ВерсияКонвертации <> ЕдинственнаяРеализованнаяВерсияКД Тогда
		Выражение = СтрШаблон("Реализована загрузка только из файлов КД%1", ЕдинственнаяРеализованнаяВерсияКД);
		ВызватьИсключение Выражение;
	КонецЕсли;
	
	//Макет = Ванесса.ПолучитьМакетОбработки(ИмяМакета);
	//Если Макет = Неопределено Тогда
	//	ВызватьИсключение "Не получили макет " + ИмяМакета;
	//КонецЕсли;
	
	КонвертацияДанных2 = Ванесса.Плагин("КонвертацияДанных2");
	
	ПолноеИмяФайла = Ванесса.Объект.КаталогПроекта + "\" + ИмяМакета;
	
	КонвертацияДанных2.ЗагрузитьИзФайла(ПолноеИмяФайла);
	
КонецПроцедуры
